test/artillery_script.yaml
config:
  target: "http://host.docker.internal:{{ targetPort }}"
  phases:
    - duration: 30
      arrivalRate: 50
      maxVusers: 50
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
scenarios:
  - flow:
      - get:
          url: "/echo?dxlxgwacmh=rpmfwkwkiy&xccemrxtyq=prfxpozvfd&otbcpgrhjt=exvbleanzv&dhxyiocqzz=bdajucgohs&boggufmgos=ogqimmyiti&xztfjdprxs=jgnliuuzyl&wbumfppuxt=lvcvfmbnix&djcypninkl=wajtltdjvi&siidwhnwzb=gpsaobnqdh&rdbznnfite=nnhxtwrhnb"
          name: GET /echo long query
      - get:
          url: "/echo?asd=asd&henry=caville"
          name: GET /echo
      - post:
          url: "/echo"
          name: POST /echo
          json:
            username: "username"
            password: "password"
      - get:
          url: "/etl"
          name: GET /etl