test/artillery_script.yaml
config:
  target: "{{ target }}"
  phases:
    - duration: 30
      arrivalRate: 50
      maxVusers: 50
  plugins:
    metrics-by-endpoint:
      # Group metrics by request name rather than URL:
      useOnlyRequestNames: true
scenarios:
  - flow:
      - get:
          url: "/echo?asd=asd&henry=caville"
          name: GET /echo
      - post:
          url: "/echo"
          name: POST /echo
          json:
            username: "username"
            password: "password"
      - get:
          url: "/etl"
          name: GET /etl